/******************************************************************************\
 *
 * $Workfile:   sm501fw.h  $
 *
 * Silicon Motion VoyagerGX SM501 audio driver firmware for 8051 controller.
 *
 * This program is free software; you can redistribute it and/or modify it under
 * the terms of the GNU General Public License as published by the Free Software
 * Foundation; either version 2 of the License, or (at your option) any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS
 * FOR A PARTICULAR PURPOSE. See the GNU General Public License for more
 * details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program; if not, write to the Free Software Foundation, Inc., 675 Mass
 * Ave, Cambridge, MA 02139, USA.
 *
 * Copyright (c) 2004, Himalaya Software
 * All Rights Reserved
 *
 * $Log:   V:/Himalaya/archives/VoyagerGX Linux/drivers/sound/sm501fw.h-arc  $
 * 
 *    Rev 1.5   Feb 25 2004 23:15:10   frido
 * Grr...
 * 
 *    Rev 1.4   Feb 25 2004 23:08:20   frido
 * Changed firmware from string to bytes.
 * 
 *    Rev 1.3   Feb 22 2004 12:09:02   frido
 * Unix EOL.
 * 
 *    Rev 1.2   Feb 12 2004 22:25:44   frido
 * Changed UCHAR and USHORT to unsigned char and unsigned short.
 * 
 *    Rev 1.1   Feb 11 2004 22:38:36   frido
 * Changed comments to C style.
 * 
 *    Rev 1.0   Feb 11 2004 22:26:54   frido
 * Initial Revision
 *
\******************************************************************************/

#ifndef _SM501FW_H_
#define _SM501FW_H_

#define SET_TX_SLOT_0                    0
#define SET_TX_SLOT_1                    1
#define SET_TX_SLOT_2                    2
#define SET_PLAYBACK_BUFFER_ADDRESS      3
#define SET_PLAYBACK_BUFFER_SIZE         4
#define SET_PLAYBACK_BUFFER_READY        5
#define GET_BUFFER_STATUS                6
#define START_STOP_AUDIO_PLAYBACK        7
#define GET_RX_SLOT0                     8
#define GET_RX_SLOT1                     9
#define GET_RX_SLOT2                    10
#define SET_CAPTURE_BUFFER_ADDRESS      11
#define SET_CAPTURE_BUFFER_SIZE         12
#define SET_CAPTIRE_BUFFER_EMPTY        13
#define START_STOP_AUDIO_CAPTURE        14
#define SET_GET_AC97_REGISTER           15



/* Initial volume */
//#define VGX_INITIALVOLUME	0x0A0A
#define VGX_INITIALVOLUME	0x3F3F

// Known AC97 codec vendors
#define AC97_VENDOR_CRYSTAL      0x43525900  // Crystal Semicondutor "CRY"
#define AC97_VENDOR_TRITECH      0x54524100  // TriTech "TRA"
#define AC97_VENDOR_AKM          0x414B4D00  // Asahi Kasei "AKM"
#define AC97_VENDOR_SIGMATEL     0x83847600  // SigmaTel
#define AC97_VENDOR_VIA1613     0x0  // SigmaTel
#define AC97_VENDOR_ALC203     0x0  // SigmaTel
#define AC97_VENDOR_ALC655     0x0  // SigmaTel

#if  0

typedef struct
{
    unsigned char firmware[0x3000];                     /* 0x0000 */
    union
    {
        struct 
        {
            unsigned char playback_buffer_0[0x0600];    /* 0x3000 */
            unsigned char playback_buffer_1[0x0600];    /* 0x3600 */
        }B;
        struct
        {
            unsigned char filler[0x0600];               /* 0x3000 */
            unsigned char capture_buffer_0[0x0300];     /* 0x3600 */
            unsigned char capture_buffer_1[0x0300];     /* 0x3900 */
        }C;
    }A;
    unsigned char filler1[0x0200];                      /* 0x3C00 */
    unsigned short ac97_regs[64];                       /* 0x3E00 */
    unsigned char filler2[0x0170];                      /* 0x3E80 */
    unsigned char command_byte;                         /* 0x3FF0 */
    unsigned char status_byte;                          /* 0x3FF1 */
    unsigned char data_byte[8];                         /* 0x3FF2 */
    unsigned char filler3[2];                           /* 0x3FFA */
    unsigned char buffer_status;                        /* 0x3FFC */
    unsigned char command_busy;                         /* 0x3FFD */
    unsigned char filler4;                              /* 0x3FFE */
    unsigned char init_count;                           /* 0x3FFF */
}
FIRMWARE_SRAM;




                 
#else

typedef struct
{
    unsigned char firmware[0x3000];                     /* 0x0000 */
    union
    {
        struct 
        {
            unsigned char playback_buffer_0[0x0300];    /* 0x3000 */
            unsigned char playback_buffer_1[0x0300];    /* 0x3300 */
        }B;
        struct
        {
            unsigned char filler[0x0600];               /* 0x3000 */
            unsigned char capture_buffer_0[0x0300];     /* 0x3600 */
            unsigned char capture_buffer_1[0x0300];     /* 0x3900 */
        }C;
    }A;
    unsigned char filler1[0x0200];                      /* 0x3C00 */
    unsigned short ac97_regs[64];                       /* 0x3E00 */
    unsigned char filler2[0x0170];                      /* 0x3E80 */
    unsigned char command_byte;                    /* 0x3FF0 */
    unsigned char status_byte;                          /* 0x3FF1 */
    unsigned char data_byte[8];                         /* 0x3FF2 */
    unsigned char filler3[2];                               /* 0x3FFA */
    unsigned char buffer_status;                        /* 0x3FFC */
    unsigned char command_busy;                    /* 0x3FFD */
    unsigned char filler4;                                  /* 0x3FFE */
    unsigned char init_count;                            /* 0x3FFF */
}
FIRMWARE_SRAM;

//Using 8051 AC97 Controller firmware version 1.4
#define FIRMWARE \
":03000000020100FA" \
":03003B00020EEEC4" \
":030043000206DCD6" \
":10010000758129750C03750D11750EFF750F2FC2C2" \
":10011000D3C2D4120D49120DB5120D2B120D0D12B2" \
":0A0120000CAB1210E112012A0100DD" \
":10012A0090110485820A85830B7497F582F5087409" \
":10013A000CF583F5097A14E493A38582088583096B" \
":10014A00850A82850B83F0A385830B85820A85093C" \
":10015A0083850882DAE1901118E4F0A3F090111A6D" \
":10016A00E4F0A3F090111CE4F0A3F090111EE4F067" \
":10017A00A3F0903FFFE004F0781876007819760033" \
":10018A009091807403F09011047A047808E0F6A341" \
":10019A0008DAFA9091007A047808E6F0A308DAFA05" \
":1001AA009011087A047808E0F6A308DAFA90910424" \
":1001BA007A047808E6F0A308DAFA90110C7A04783F" \
":1001CA0008E0F6A308DAFA9091087A047808E6F0CB" \
":1001DA00A308DAFA9011107A047808E0F6A308DA8C" \
":1001EA00FA90910C7A047808E6F0A308DAFA9011EA" \
":1001FA00147A047808E0F6A308DAFA9091107A04DF" \
":10020A007808E6F0A308DAFA909140E4F0A3F0A3A4" \
":10021A00F0A3F0909144E4F0A3F0A3F0A3F090913E" \
":10022A0048E4F0A3F0A3F0A3F0901120E4F0A3F0C7" \
":10023A00120046901118E4F0A3F0901118C3E0944C" \
":10024A00E8A3E0940330D204B2E7D2E030E7389072" \
":10025A00111AE4F0A3F090111AC3E094C8A3E09431" \
":10026A000030D204B2E7D2E030E70E90111AE0244F" \
":10027A0001F0A3E03400F080DD901118E02401F0D1" \
":10028A00A3E03400F080B39091807401F0901120C3" \
":10029A0074FFF0A3E4F0120046901118E4F0A3F002" \
":1002AA00901118C3E094E8A3E0940330D204B2E7B3" \
":1002BA00D2E030E73890111AE4F0A3F090111AC393" \
":1002CA00E09464A3E0940030D204B2E7D2E030E7CD" \
":1002DA000E90111AE02401F0A3E03400F080DD90C2" \
":1002EA001118E02401F0A3E03400F080B3909140AB" \
":1002FA00E05400F508A3E05480F509A3E05400F5A2" \
":10030A000AA3E05400F50B78087A04E6700308DAC9" \
":10031A00FA6002800280D690112074FFF0A3E4F004" \
":10032A00120046909140E05400F508A3E05480F58D" \
":10033A0009A3E05400F50AA3E05400F50B78087A03" \
":10034A0004E6700308DAFA6002800280D6903FF071" \
":10035A00740FF0903FF2E4F0A37460F0A3740AF013" \
":10036A00A3E4F0903FF6E4F0A3F0A3F0A3F0120E9A" \
":10037A0079903FF6E054F0F5087A037808A308E08C" \
":10038A005400F6DAF878087A04E6700308DAFA60B4" \
":10039A0002800280B8903FF0740FF0903FF2E4F0D0" \
":1003AA00A37460F0A3740AF0A3E4F0903FF6E4F0BB" \
":1003BA00A3F0A3F0A3F0120E79903FF6E054F0F503" \
":1003CA00087A037808A308E05400F6DAF878087A7D" \
":1003DA0004E6700308DAFA6002800280B890111A03" \
":1003EA00E4F0A3F0901118E4F0A3F0903FFFE004CA" \
":1003FA00F07819E670567818E67051901118C3E033" \
":10040A0094E87004A3E09403702C901118E4F0A30C" \
":10041A00F090111AE02401F0A3E03400F090111AD0" \
":10042A00C3E094907004A3E09401700A90111AE456" \
":10043A00F0A3F01208FE901118E02401F0A3E034B2" \
":10044A0000F0781BE66003120E7980A5901118E47B" \
":10045A00F0A3F07819E670057818E6600A781BE6CA" \
":10046A006003120E7980EC0203FB909180E4F02283" \
":10047A00901120E04400F508A3E04400F509A3E048" \
":10048A004408F50AA3E04400F50B90112A7A04788F" \
":10049A0008E6F0A308DAFA9011267400F0A3743E75" \
":1004AA00F09011207A047808E0F6A308DAFA7A0DB7" \
":1004BA00E50BA2E713F50BE50A13F50AE50913F5AF" \
":1004CA0009E50813F508DAE8E508C333F508E5098C" \
":1004DA0033F509901126E02508F0A3E03509F090DC" \
":1004EA0011287400F0A3743FF09011207A04780860" \
":1004FA00E0F6A308DAFA7A0DE50BA2E713F50BE5A5" \
":10050A000A13F50AE50913F509E50813F508DAE807" \
":10051A00E508C333F508E50933F509901128E02504" \
":10052A0008F0A3E03509F0909108E4F0A3F0A3F0F5" \
":10053A00A3F090112A7A047808E0F6A308DAFA9070" \
":10054A0091047A047808E6F0A308DAFA9091007523" \
":10055A0008007509E0750A00750B007A047808E04E" \
":10056A0046F0A308DAF9901124E4F0A3F0901124DC" \
":10057A00C3E09480A3E0943830D204B2E7D2E020FA" \
":10058A00E70302066F909140E05400F508A3E05497" \
":10059A0060F509A3E05400F50AA3E05400F50B78CE" \
":1005AA00087A04E6700308DAFA700302066090918A" \
":1005BA0000750800750998750A00750B007A0478A9" \
":1005CA0008E056F0A308DAF99091487A047808E02E" \
":1005DA00F6A308DAFA903FF67A047808E6F0A30858" \
":1005EA00DAFA9091487A047808E0F6A308DAFA7AF7" \
":1005FA0004E50BA2E713F50BE50A13F50AE509135F" \
":10060A00F509E50813F508DAE8901126E0FAA3E0FF" \
":10061A008A82F583E508F0A3E509F09091487A0407" \
":10062A007808E0F6A308DAFA7A04E50BA2E713F5EC" \
":10063A000BE50A13F50AE50913F509E50813F508A8" \
":10064A00DAE8901128E0FAA3E08A82F583E508F057" \
":10065A00A3E509F0800F901124E02401F0A3E0340F" \
":10066A0000F0020577901124E4F0A3F0901124C35E" \
":10067A00E09480A3E0943830D204B2E7D2E030E7C5" \
":10068A0036909140E05400F508A3E05460F509A3C0" \
":10069A00E05400F50AA3E05400F50B78087A04E662" \
":1006AA00700308DAFA7002800E901124E02401F037" \
":1006BA00A3E03400F080B5909100750800750998A0" \
":1006CA00750A00750B007A047808E056F0A308DA78" \
":0206DA00F92203" \
":1006DC00C0E0C082C083C0D0C008C009C00AC00B33" \
":1006EC00C2D3D2D4C2AF53E8F97818E6700302072C" \
":1006FC00DF909140E05400F508A3E05418F509A3ED" \
":10070C00E05400F50AA3E05400F50B78087A04E6EF" \
":10071C00700308DAFA70030207DF90914C7A0478C0" \
":10072C0008E0F6A308DAFA9010F1E0FAA3E08A8266" \
":10073C00F5837A047808E6F0A308DAFA9010F1E071" \
":10074C002404F0A3E03400F09091507A047808E08F" \
":10075C00F6A308DAFA9010F1E0FAA3E08A82F583A6" \
":10076C007A047808E6F0A308DAFA9010F1E0240491" \
":10077C00F0A3E03400F09010F1C3E094007004A3F7" \
":10078C00E09439701B903FFCE054CFF0903FFCE0BC" \
":10079C004410F09090087401F0A3E4F0A3F0A3F0DF" \
":1007AC009010F1C3E094007004A3E0943C7024908A" \
":1007BC003FFCE054CFF0903FFCE04420F09010F16F" \
":1007CC00E4F0A37436F09090087401F0A3E4F0A365" \
":1007DC00F0A3F07819E670030208D3909144E0542A" \
":1007EC0000F508A3E0540CF509A3E05400F50AA3A6" \
":1007FC00E05400F50B78087A04E6700308DAFA7016" \
":10080C00028019900034E0F508E4F509F50AF50BBF" \
":10081C0078087A04E6700308DAFA70030208479045" \
":10082C0091007508FF7509E77A027808E056F0A385" \
":10083C0008DAF9900034E4F00208D39091017509BC" \
":10084C00987809E046F09010EFE0FAA3E08A82F580" \
":10085C00837A077808E0F6A308DAFA90910C7A0606" \
":10086C007808E6F0A308DAFAE6F09010EFE0240836" \
":10087C00F0A3E03400F09010EFC3E094007015A3E7" \
":10088C00E09433700F903FFCE054FC4401F09090E6" \
":10089C00087401F09010EFC3E094007024A3E0946E" \
":1008AC0036701E903FFCE054FC4402F09010EFE4D4" \
":1008BC00F0A37430F09090087401F090003474013F" \
":1008CC00F09000347401F0909181E054FC6004E0ED" \
":1008DC005403F0781DE660011643E80643F804D291" \
":1008EC00AFD00BD00AD009D008D0D0D083D082D0D2" \
":0208FC00E032E8" \
":1008FE009011247400F0A3743EF0901126E4F0A33E" \
":10090E00F0A37408F0A3E4F0909108E4F0A3F0A330" \
":10091E00F0A3F0901120E4F0A3F0901120C3E09426" \
":10092E0040A3E0940030D204B2E7D2E020E7030205" \
":10093E000AB89011267A047808E0F6A308DAFA903D" \
":10094E0091047A047808E6F0A308DAFA909100751B" \
":10095E0008007509C0750A00750B007A047808E066" \
":10096E0046F0A308DAF9901122E4F0A3F0901122D8" \
":10097E00C3E09440A3E0941F30D204B2E7D2E0204B" \
":10098E00E703020A1D909140E05400F508A3E054DD" \
":10099E0060F509A3E05400F50AA3E05400F50B78C6" \
":1009AE00087A04E6700308DAFA605590910075082B" \
":1009BE0000750998750A00750B007A047808E056E0" \
":1009CE00F0A308DAF99091487A047808E0F6A308C3" \
":1009DE00DAFA7A04E50BA2E713F50BE50A13F50A2A" \
":1009EE00E50913F509E50813F508DAE8901124E096" \
":1009FE00FAA3E08A82F583E508F0A3E509F0800FFB" \
":100A0E00901122E02401F0A3E03400F002097B9063" \
":100A1E001124E02402F0A3E03400F0901126E0242B" \
":100A2E0000F508A3E03420F509A3E03400F50AA38D" \
":100A3E00E03400F50B9011267A047808E6F0A3084E" \
":100A4E00DAFA901122E4F0A3F0901122C3E0944060" \
":100A5E00A3E0941F30D204B2E7D2E030E736909193" \
":100A6E0040E05400F508A3E05460F509A3E05400FB" \
":100A7E00F50AA3E05400F50B78087A04E670030833" \
":100A8E00DAFA7002800E901122E02401F0A3E03415" \
":100A9E0000F080B5781BE66002800F901120E024F4" \
":100AAE0001F0A3E03400F0020928909100750800CF" \
":100ABE00750998750A00750B007A047808E056F0EF" \
":050ACE00A308DAF92283" \
":100AD300903FF27A047808E0F6A308DAFA909104DA" \
":100AE3007A047808E6F0A308DAFA903FF67A0478F5" \
":100AF30008E0F6A308DAFA9091087A047808E6F099" \
":100B0300A308DAFA903FF67A047808E0F6A308DA45" \
":100B1300FA9011307A047808E6F0A308DAFA903FE5" \
":100B2300F17401F0909104E05400F508A3E054003F" \
":100B3300F509A3E05408F50AA3E05400F50B78087F" \
":100B43007A04E6700308DAFA601E903FF27A0478BA" \
":100B530008E0F6A308DAFA90112078087A04E6F0A0" \
":100B6300A308DAFA12047A22909100750800750935" \
":100B7300E0750A00750B007A047808E046F0A308D4" \
":100B8300DAF9781D7603781DE6600990112EE4F0FA" \
":100B9300A3F080F2909100750800750998750A001A" \
":100BA300750B007A047808E056F0A308DAF9781D8B" \
":100BB3007614781DE6600990112EE4F0A3F080F21C" \
":100BC30090112EE4F0A3F090112EC3E09480A3E0E3" \
":100BD300943830D204B2E7D2E030E736909140E067" \
":100BE3005400F508A3E05460F509A3E05400F50AA6" \
":100BF300A3E05400F50B78087A04E6700308DAFAE8" \
":100C03007002800E90112EE02401F0A3E03400F076" \
":100C130080B590112EC3E09480A3E0943830D204C1" \
":100C2300B2E7D2E030E74C903FF27A047808E0F67E" \
":100C3300A308DAFA90112078087A04E6F0A308DA18" \
":100C4300FA12047A903FF67A047808E0F6A308DAF9" \
":100C5300FA901130C3E095087010A3E09509700A6B" \
":100C6300A3E0950A7004A3E0950B6006903FF1742E" \
":100C7300FFF022909100750800750998750A0075B8" \
":100C83000B007A047808E056F0A308DAF9903FF1F4" \
":040C930074FFF022D8" \
":100C970000800000000000000000000000000800C5" \
":100CA70000000800741470047400601E9010BDA842" \
":100CB70083A9829010EFAA83AB82901103AC83AD16" \
":100CC70082C3ED9B7028EC9A702474017004740041" \
":100CD700601B900035AC83AD82900034C3ED9582E4" \
":100CE7007005EC95836006E4F0A3020CE322888389" \
":100CF7008982E493A3A883A9828A838B82F0A3AA1B" \
":100D070083AB82020CC87400600D9000007900FA72" \
":100D1700E493F7A309DAF9741160087818FAE4F68E" \
":100D270008DAFC227400600D9000007900FAE49361" \
":100D3700F7A309DAF9740060087800FAE4F608DA2C" \
":100D4700FC2274006035FB900000740075F0088485" \
":100D57002420F87A08E5F06007E6031AD5F0FBF6D9" \
":100D6700EB600D1BE493A3A2E0E613F6DAF280052D" \
":100D7700E603DAFDF6087A08EB70E57400602EFBEF" \
":100D8700740075F008842420F87A08E5F06007E617" \
":100D9700031AD5F0FBF6EB60091BC3E613F6DAF688" \
":100DA7008005E603DAFDF6087A08EB70E92274009D" \
":100DB700600D9000007900FAE493F7A309DAF9745B" \
":0C0DC7000060087800FAE4F608DAFC226C" \
":10004600901124E4F0A37430F0901122E4F0A3F0B0" \
":10005600901122C3E094F0A3E0940F30D204B2E7EB" \
":10006600D2E030E72E901120E0901124C0E0E0FAB3" \
":10007600A3E08A82F583D0E0F0901124E02401F019" \
":10008600A3E03400F0901122E02401F0A3E0340054" \
":10009600F080BD901124E4F0A3743CF0901122E4AA" \
":1000A600F0A3F0901122C3E09400A3E0940130D2B3" \
":1000B60004B2E7D2E030E72E901122E0901124C07E" \
":1000C600E0E0FAA3E08A82F583D0E0F0901124E024" \
":1000D6002401F0A3E03400F0901122E02401F0A303" \
":0700E600E03400F080BD22B0" \
":100DD3009010FBE0FAA3E08A82F583E060109010A4" \
":100DE300F1E4F0A37436F078187601020E727818E5" \
":100DF30076009010F1E0F508A3E0F509901120E5E5" \
":100E030008F0A3E509F0901120C3E09400F508A3CE" \
":100E1300E09436F509901120E508F0A3E509F09078" \
":100E23001120C3E094007A0060010AA3E094034A0E" \
":100E330030D204B2E7D2E020E7027002801F7825A7" \
":100E43007600087603901120C3E09400F508A3E030" \
":100E53009403F5097827A60808A60980127827764F" \
":100E6300000876039011207825E0F608A3E0F690B9" \
":060E73003FF1740EF022B5" \
":100E7900903FFD7401F0903FF1E4F0903FF0E0FA0B" \
":100E8900333354FC2A781EF6900E96E673120FBF80" \
":100E99008049120FE18044121002803F1200ED8058" \
":100EA9003A120003803512108680301210A2802B6E" \
":100EB900120F9780261210238021121044801C12D1" \
":100EC900106580171210D18012120F41800D120F78" \
":100ED9006E8008120DD38003120AD3781B76009016" \
":050EE9003FFDE4F022D2" \
":100EEE00C0E0C082C083C0D0C008C009C00AC00B19" \
":100EFE00C2D3D2D4C2AF53E8F9781B7601903FFD2E" \
":100F0E007401F090900C7A047808E0F6A308DAFAEF" \
":100F1E009000307A047808E6F0A308DAFA43E8067F" \
":100F2E00D2AFD00BD00AD009D008D0D0D083D08287" \
":030F3E00D0E032CE" \
":100003009010F7E0FAA3E08A82F5837821E0F608FE" \
":10001300A3E0F69010F9E0FAA3E08A82F58378234F" \
":0D002300E0F608A3E0F6903FF17401F02232" \
":100F410078259010F7E0FAA3E08A82F583E6F0A312" \
":100F510008E6F078279010F9E0FAA3E08A82F58399" \
":0D0F6100E6F0A308E6F0903FF17401F022E5" \
":100F6E009010FBE0FAA3E08A82F583E044CFF09084" \
":100F7E0010FBE0FAA3E08A82F583E0903FFCFAE0F2" \
":090F8E005AF0903FF17401F022C9" \
":100F97009010FBE0FAA3E08A82F583E0600F9010DF" \
":100FA700EFE4F0A37430F0781976018004781976AD" \
":080FB70000903FF17401F022EB" \
":100FBF00903FF27A047808E0F6A308DAFA909100ED" \
":100FCF007A047808E046F0A308DAF9903FF174014B" \
":020FDF00F022FE" \
":100FE100903FF27A047808E0F6A308DAFA909104C7" \
":100FF1007A047808E6F0A308DAFA903FF17401F078" \
":0110010022CC" \
":10100200903FF27A047808E0F6A308DAFA909108A1" \
":101012007A047808E6F0A308DAFA903FF17401F056" \
":0110220022AB" \
":101023009091407A047808E0F6A308DAFA903FF248" \
":101033007A047808E6F0A308DAFA903FF17401F035" \
":01104300228A" \
":101044009091447A047808E0F6A308DAFA903FF223" \
":101054007A047808E6F0A308DAFA903FF17401F014" \
":011064002269" \
":101065009091487A047808E0F6A308DAFA903FF2FE" \
":101075007A047808E6F0A308DAFA903FF17401F0F3" \
":011085002248" \
":101086009010FBE0FAA3E08A82F583E05403903FD8" \
":0C109600FCFAE04AF0903FF17401F022F7" \
":1010A200903FFCE09010FBC0E0E0FAA3E08A82F5FA" \
":0B10B20083D0E0F0903FF17401F022C9" \
":1010BD000030003641914591F23FF43FF23FF33F4E" \
":0410CD00F43FF53FB8" \
":1000ED009010EFE4F0A37430F0903FF17401F02222" \
":1010D1009010F1E4F0A37436F0903FF17401F02226" \
":0E10E10075E80675F804D2AF900034E4F022F2" \
":00000001FF"





#endif


#endif /* _SM501FW_H_ */

